app/views/piece_informs/index.html.haml

        %td= piece_inform.language
        %td= link_to 'Edit', edit_exhibition_piece_piece_inform_path(Piece.find(params[:piece_id]).exhibition,piece_inform.piece,piece_inform)
---
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", 5]]