app/controllers/audioguides_controller.rb

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @exhibition = Exhibition.find(params[:exhibition_id])

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @exhibition = Exhibition.find(params[:exhibition_id])

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @audioguide = Audioguide.new
    @audioguide.exhibition = Exhibition.find(params[:exhibition_id])

SELECT  "audioguides".* FROM "audioguides" WHERE "audioguides"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @audioguide = Audioguide.find(params[:id])

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "audioguides" ("name", "description", "text", "audio", "exhibition_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "qq"], ["description", "qq"], ["text", "qq"], ["audio", "qq"], ["exhibition_id", 1], ["created_at", "2016-01-10 11:34:48.082284"], ["updated_at", "2016-01-10 11:34:48.082284"]]
---
  def create
    @audioguide = Audioguide.new(audioguide_params)
    @audioguide.exhibition_id = Exhibition.find(params[:exhibition_id]).id

    respond_to do |format|
      if @audioguide.save

UPDATE "audioguides" SET "name" = ?, "key" = ?, "id1" = ?, "id2" = ?, "updated_at" = ? WHERE "audioguides"."id" = ?  [["name", "asaaaaa"], ["key", "0"], ["id1", 0], ["id2", 0], ["updated_at", "2016-01-18 01:06:08.217901"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @audioguide.update(audioguide_params)

DELETE FROM "audioguides" WHERE "audioguides"."id" = ?  [["id", 2]]
---
  def destroy
    @audioguide.destroy

SELECT  "audioguides".* FROM "audioguides" WHERE "audioguides"."id" = ? LIMIT 1  [["id", 9]]
---
    def set_audioguide
      @audioguide = Audioguide.find(params[:id])