app/controllers/audioguide_informs_controller.rb

SELECT  "audioguides".* FROM "audioguides" WHERE "audioguides"."id" = ? LIMIT 1  [["id", 14]]
---
  def index
    @audioguide = Audioguide.find(params[:audioguide_id])

SELECT "audioguide_informs".* FROM "audioguide_informs" INNER JOIN "audioguides" ON "audioguides"."id" = "audioguide_informs"."audioguide_id" WHERE "audioguides"."exhibition_id" IS NULL AND (language LIKE '%english%')  ORDER BY created_at DESC
SELECT "audioguide_informs".* FROM "audioguide_informs" INNER JOIN "audioguides" ON "audioguides"."id" = "audioguide_informs"."audioguide_id" WHERE "audioguides"."exhibition_id" = 4
---
  def search
    if params[:search]
      @audioguide_informs = AudioguideInform.joins(:audioguide).where('audioguides.exhibition_id' => params[:exhibition_id]).search(params[:search]).order("created_at DESC")
    else
      @audioguide_informs = AudioguideInform.joins(:audioguide).where('audioguides.exhibition_id' => params[:exhibition_id])

SELECT  "audioguides".* FROM "audioguides" WHERE "audioguides"."id" = ? LIMIT 1  [["id", 14]]
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]
---
  def new
    @audioguide_inform = AudioguideInform.new

    @audioguide_inform.audioguide_id = Audioguide.find(params[:audioguide_id]).id
    @path = { url: exhibition_audioguide_audioguide_informs_path(Audioguide.find(params[:audioguide_id]).exhibition,@audioguide_inform.audioguide_id), html: { method: :post } }

SELECT  "audioguide_informs".* FROM "audioguide_informs" WHERE "audioguide_informs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "audioguides".* FROM "audioguides" WHERE "audioguides"."id" = ? LIMIT 1  [["id", 14]]
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
    @audioguide_inform = AudioguideInform.find(params[:id])
    @path = { url: "#{exhibition_audioguide_audioguide_informs_path(Audioguide.find(params[:audioguide_id]).exhibition,@audioguide_inform.audioguide)}/#{@audioguide_inform.id}", html: { method: :put } }

SELECT  "audioguides".* FROM "audioguides" WHERE "audioguides"."id" = ? LIMIT 1  [["id", 14]]
INSERT INTO "audioguide_informs" ("name", "description", "text", "language", "audioguide_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "qq"], ["description", "qq"], ["text", "qq"], ["language", "english"], ["audioguide_id", 14], ["created_at", "2016-02-03 23:18:41.471199"], ["updated_at", "2016-02-03 23:18:41.471199"]]
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]
---
  def create
    @audioguide_inform = AudioguideInform.new(audioguide_inform_params)
    @audioguide_inform.audioguide_id = Audioguide.find(params[:audioguide_id]).id

    respond_to do |format|
      if @audioguide_inform.save
        format.html { redirect_to exhibition_audioguide_audioguide_informs_path(Audioguide.find(params[:audioguide_id]).exhibition,@audioguide_inform.audioguide_id), notice: 'Audioguide inform was successfully created.' }

UPDATE "audioguide_informs" SET "name" = ?, "updated_at" = ? WHERE "audioguide_informs"."id" = ?  [["name", "qqw"], ["updated_at", "2016-02-03 23:18:45.013867"], ["id", 1]]
SELECT  "audioguides".* FROM "audioguides" WHERE "audioguides"."id" = ? LIMIT 1  [["id", 14]]
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]
---
  def update
    respond_to do |format|
      if @audioguide_inform.update(audioguide_inform_params)
        format.html { redirect_to exhibition_audioguide_audioguide_informs_path(Audioguide.find(params[:audioguide_id]).exhibition,@audioguide_inform.audioguide), notice: 'Audioguide inform was successfully updated.' }

DELETE FROM "audioguide_informs" WHERE "audioguide_informs"."id" = ?  [["id", 1]]
---
  def destroy
    @audioguide_inform.destroy

SELECT "audioguide_informs".* FROM "audioguide_informs" WHERE "audioguide_informs"."audioguide_id" = ?  [["audioguide_id", 14]]
---
    def set_audioguide_inform
      @audioguide_inform = AudioguideInform.find(params[:id])