app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "description", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "tt"], ["description", "tt"], ["date", "2016-01-26"], ["created_at", "2016-01-26 02:31:45.801870"], ["updated_at", "2016-01-26 02:31:45.801870"]]