app/controllers/exhibition_informations_controller.rb

  def search
    if params[:search]
      @exhibition_informations = ExhibitionInformation.search(params[:search]).order("created_at DESC")
---
SELECT "exhibition_informations".* FROM "exhibition_informations"  ORDER BY created_at DESC