app/controllers/exhibitions_controller.rb

  def index
    @exhibitions = Exhibition.all
---
SELECT "exhibitions".* FROM "exhibitions"

  def create
    @item = Item.new
    puts "nuevo item"
    puts @item.id

    @exhibition = Exhibition.new(exhibition_params)
    @exhibition.item_id = @item.id

    respond_to do |format|
      if @exhibition.save
---
INSERT INTO "exhibitions" ("name", "description", "miniDescription", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "JAde"], ["description", "sjsjs"], ["miniDescription", "jsjsjs"], ["created_at", "2015-12-16 08:33:04.532882"], ["updated_at", "2015-12-16 08:33:04.532882"]]

  def update
    respond_to do |format|
      if @exhibition.update(exhibition_params)
---
UPDATE "exhibitions" SET "file" = ?, "updated_at" = ? WHERE "exhibitions"."id" = ?  [["file", "Museo-Jade-precolombinas-ALBERT-MARIN_LNCIMA20140506_0019_3.jpg"], ["updated_at", "2016-02-03 02:31:27.044273"], ["id", 4]]

  def destroy
    @exhibition.destroy
---
DELETE FROM "exhibitions" WHERE "exhibitions"."id" = ?  [["id", 1]]

    def set_exhibition
      @exhibition = Exhibition.find(params[:id])
---
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 2]]