app/controllers/exhibition_informations_controller.rb

  def index
    @exhibition = Exhibition.find(params[:exhibition_id])
    @exhibition_informations = @exhibition.exhibition_informations

    if params[:search]
      @exhibition_informations = ExhibitionInformation.search(params[:search]).order("created_at DESC")
---
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]
SELECT "exhibition_informations".* FROM "exhibition_informations" WHERE (language LIKE '%21%')  ORDER BY created_at DESC

  def new
    @exhibition_information = ExhibitionInformation.new

    @exhibition_information.exhibition_id = Exhibition.find(params[:exhibition_id]).id
---
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]

  def edit
    @exhibition_information = ExhibitionInformation.find(params[:id])
---
SELECT  "exhibition_informations".* FROM "exhibition_informations" WHERE "exhibition_informations"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @exhibition_information = ExhibitionInformation.new(exhibition_information_params)
    @exhibition_information.exhibition_id = Exhibition.find(params[:exhibition_id]).id

    respond_to do |format|
      if @exhibition_information.save
---
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "exhibition_informations" ("name", "description", "miniDescription", "language", "exhibition_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @exhibition_information.update(exhibition_information_params)
---
UPDATE "exhibition_informations" SET "language" = ?, "updated_at" = ? WHERE "exhibition_informations"."id" = ?  [["language", "spanish"], ["updated_at", "2016-02-02 01:15:12.676357"], ["id", 2]]

  def destroy
    @exhibition_information.destroy
---
DELETE FROM "exhibition_informations" WHERE "exhibition_informations"."id" = ?  [["id", 1]]

    def set_exhibition_information
      @exhibition_information = ExhibitionInformation.find(params[:id])
---
SELECT "exhibition_informations".* FROM "exhibition_informations" WHERE "exhibition_informations"."exhibition_id" = ?  [["exhibition_id", 4]]