app/controllers/exhibition_images_controller.rb

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 5]]
---
  def index
    @exhibition = Exhibition.find(params[:exhibition_id])

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 5]]
---
  def new
    @exhibition_image = ExhibitionImage.new
    @exhibition_image.exhibition_id = Exhibition.find(params[:exhibition_id]).id

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "exhibition_images" ("file", "exhibition_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["file", "monogatari-5-7-black-hanekawa.jpg"], ["exhibition_id", 5], ["created_at", "2015-12-17 08:54:04.496828"], ["updated_at", "2015-12-17 08:54:04.496828"]]
---
  def create
    @exhibition_image = ExhibitionImage.new(exhibition_image_params)
     @exhibition_image.exhibition_id = Exhibition.find(params[:exhibition_id]).id

    respond_to do |format|
      if @exhibition_image.save

DELETE FROM "exhibition_images" WHERE "exhibition_images"."id" = ?  [["id", 1]]
---
  def destroy
    @exhibition_image.destroy

SELECT "exhibition_images".* FROM "exhibition_images" WHERE "exhibition_images"."exhibition_id" = ?  [["exhibition_id", 5]]
---
    def set_exhibition_image
      @exhibition_image = ExhibitionImage.find(params[:id])