app/controllers/piece_informs_controller.rb

SELECT "piece_informs".* FROM "piece_informs"  ORDER BY created_at DESC
---
  def index
    @piece = Piece.find(params[:piece_id])
    @piece_informs = @piece.piece_informs

    if params[:search]
      @piece_informs = PieceInform.search(params[:search]).order("created_at DESC")