app/controllers/piece_informs_controller.rb

  def index
    @piece = Piece.find(params[:piece_id])
---
SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", 5]]

  def search
    if params[:search]
      @piece_informs = PieceInform.joins(:piece).where('pieces.exhibition_id' => params[:exhibition_id]).search(params[:search]).order("created_at DESC")
    else
      @piece_informs = PieceInform.joins(:piece).where('pieces.exhibition_id' => params[:exhibition_id])
---
SELECT "piece_informs".* FROM "piece_informs" INNER JOIN "pieces" ON "pieces"."id" = "piece_informs"."piece_id" WHERE "pieces"."exhibition_id" IS NULL AND (language LIKE '%english%')  ORDER BY created_at DESC
SELECT "piece_informs".* FROM "piece_informs" INNER JOIN "pieces" ON "pieces"."id" = "piece_informs"."piece_id" WHERE "pieces"."exhibition_id" IS NULL

  def new
    @piece_inform = PieceInform.new

    @piece_inform.piece_id = Piece.find(params[:piece_id]).id
    @path = { url: exhibition_piece_piece_informs_path(Piece.find(params[:piece_id]).exhibition,@piece_inform.piece_id), html: { method: :post } }
---
SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]

  def edit
    @piece_inform = PieceInform.find(params[:id])
    @path = { url: "#{exhibition_piece_piece_informs_path(Piece.find(params[:piece_id]).exhibition,@piece_inform.piece)}/#{@piece_inform.id}", html: { method: :put } }
---
SELECT  "piece_informs".* FROM "piece_informs" WHERE "piece_informs"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", 5]]

  def create
    @piece_inform = PieceInform.new(piece_inform_params)
    @piece_inform.piece_id = Piece.find(params[:piece_id]).id


    respond_to do |format|
      if @piece_inform.save
        format.html { redirect_to exhibition_piece_piece_informs_path(Piece.find(params[:piece_id]).exhibition,@piece_inform.piece_id), notice: 'Piece inform was successfully created.' }
---
SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "piece_informs" ("name", "description", "language", "piece_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ww"], ["description", "ww"], ["language", "ww"], ["piece_id", 5], ["created_at", "2016-02-02 01:03:12.673002"], ["updated_at", "2016-02-02 01:03:12.673002"]]
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]

  def update
    respond_to do |format|
      if @piece_inform.update(piece_inform_params)
        format.html { redirect_to exhibition_piece_piece_informs_path(Piece.find(params[:piece_id]).exhibition,@piece_inform.piece), notice: 'Piece inform was successfully updated.' }
---
UPDATE "piece_informs" SET "name" = ?, "language" = ?, "updated_at" = ? WHERE "piece_informs"."id" = ?  [["name", "aa"], ["language", "spanish"], ["updated_at", "2016-02-03 09:07:41.239928"], ["id", 2]]
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", 5]]

  def destroy
    @piece_inform.destroy
---
DELETE FROM "piece_informs" WHERE "piece_informs"."id" = ?  [["id", 1]]

    def set_piece_inform
      @piece_inform = PieceInform.find(params[:id])
---
SELECT "piece_informs".* FROM "piece_informs" WHERE "piece_informs"."piece_id" = ?  [["piece_id", 5]]