app/controllers/pieces_controller.rb

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @exhibition = Exhibition.find(params[:exhibition_id])

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    @exhibition = Exhibition.find(params[:exhibition_id])

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @piece = Piece.new
    @piece.exhibition_id = Exhibition.find(params[:exhibition_id]).id

SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @piece = Piece.find(params[:id])

SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "pieces" ("name", "description", "room", "showcase", "exhibition_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "aa"], ["description", "aa"], ["room", "aa"], ["showcase", "aa"], ["exhibition_id", 1], ["created_at", "2015-12-16 09:26:18.186126"], ["updated_at", "2015-12-16 09:26:18.186126"]]
---
  def create
    @piece = Piece.new(piece_params)
    @piece.exhibition_id = Exhibition.find(params[:exhibition_id]).id

    respond_to do |format|
      if @piece.save

UPDATE "pieces" SET "name" = ?, "updated_at" = ? WHERE "pieces"."id" = ?  [["name", "bb"], ["updated_at", "2016-01-26 02:18:02.188545"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @piece.update(piece_params)

DELETE FROM "pieces" WHERE "pieces"."id" = ?  [["id", 4]]
---
  def destroy
    @piece.destroy

SELECT  "pieces".* FROM "pieces" WHERE "pieces"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_piece
      @piece = Piece.find(params[:id])