app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" WHERE (code LIKE '%u%')  ORDER BY created_at DESC
---
  def index
    @tickets = Ticket.all

INSERT INTO "tickets" ("adult", "child", "student", "elder", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["adult", 1], ["child", 1], ["student", 0], ["elder", 0], ["date", "2016-01-17"], ["created_at", "2016-01-17 09:25:27.645565"], ["updated_at", "2016-01-17 09:25:27.645565"]]
---
  def create
    puts "tomela toda"
    @ticket = Ticket.new(ticket_params)
    respond_to do |format|
      if @ticket.save

DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]
---
  def destroy
    @ticket.destroy

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_ticket
      @ticket = Ticket.find(params[:id])