app/views/audioguide_informs/index.html.haml

        %td= audioguide_inform.language
        %td= link_to 'Edit', edit_exhibition_audioguide_audioguide_inform_path(Audioguide.find(params[:audioguide_id]).exhibition,audioguide_inform.audioguide,audioguide_inform)
---
SELECT  "audioguides".* FROM "audioguides" WHERE "audioguides"."id" = ? LIMIT 1  [["id", 14]]
SELECT  "exhibitions".* FROM "exhibitions" WHERE "exhibitions"."id" = ? LIMIT 1  [["id", 4]]